/**
 * tmsky.const
 * Created by hai on 2015/12/11.
 */
(function (global, tmsky) {
    tmsky.extend({
        ENCRYPT_FLAG : {
            CACHE : {
                LOCALSTORAGE : true
            }
        },
        banks : [
            '中国工商银行', '中国农业银行', '中国建设银行', '招商银行', '中国银行', '中国邮政储蓄银行', '交通银行', '中信银行', '中国民生银行', '安徽省农村信用社', '鞍山银行', '北京银行', '北京农商行', '渤海银行', '包商银行',
            '长安银行', '长沙银行', '沧州银行', '成都银行', '重庆农村商业银行', '常熟农商银行', '重庆银行', '承德银行', '成都农商银行', '东亚银行', '德阳银行', '大连银行', '东莞农村商业银行', '东莞银行', '东营银行', '德州银行',
            '鄂尔多斯银行', '富邦华一银行', '福建省农村信用社联合社', '阜新银行', '富滇银行', '福建海峡银行', '广发银行', '贵阳银行', '桂林银行', '贵州省农村信用社联合社', '广西北部湾银行', '广东省农村信用社联合社', '广东华兴银行',
            '广州农村商业银行', '赣州银行', '广西壮族自治区农村信用社联合社', '广东南粤银行', '广州银行', '华夏银行', '恒丰银行', '湖北省农村信用合作联社', '韩亚银行', '徽商银行', '哈尔滨银行', '葫芦岛银行', '海口联合农商银行', '杭州银行', '河北银行', '邯郸银行', '海南省农村信用社', '汉口银行', '湖北银行', '湖州银行',
            '江苏银行', '江苏省农村信用社联合社', '济宁银行', '吉林银行', '吉林省农村信用社联合社', '晋商银行', '江苏太仓农村商业银行', '晋城银行', '江西省农村信用社', '九江银行', '嘉兴银行', '江苏长江商业银行',
            '江苏江阴农村商业银行', '锦州银行', '昆仑银行', '昆山农村商业银行', '莱商银行', '龙江银行', '柳州银行', '兰州银行', '临商银行', '洛阳银行', '廊坊银行', '绵阳市商业银行',
            '宁波银行', '南京银行', '宁夏银行', '宁夏黄河农村商业银行', '南充市商业银行', '内蒙古银行', '南昌银行', '浦发银行', '平安银行', '攀枝花市商业银行',
            '平顶山银行', '齐商银行', '青岛银行', '泉州银行', '青海银行', '齐鲁银行', '日照银行', '上海银行', '绍兴银行', '深圳农村商业银行', '顺德农商银行', '上饶银行', '陕西信合', '上海农商银行', '苏州银行',
            '四川省农村信用社联合社', '山东省农村信用社联合社', '天津银行', '泰安市商业银行', '天津农商银行', '天津滨海农村商业银行', '台州银行', '潍坊银行', '乌鲁木齐市商业银行', '威海市商业银行', '温州银行', '武汉农村商业银行',
            '吴江农村商业银行', '兴业银行', '邢台银行', '厦门银行', '西安银行', '新韩银行', '鄞州银行', '烟台银行', '友利银行', '云南省农村信用社', '营口银行', '中国光大银行',
            '浙江民泰商业银行', '浙商银行', '枣庄银行', '珠海华润银行', '郑州银行', '张家港农村商业银行', '中原银行', '张家口市商业银行', '浙江稠州商业银行', '浙江泰隆商业银行',
            '浙江省农村信用社联合社', '自贡市商业银行','贵州银行','重庆渝北银座村镇银行','重庆黔江银座村镇银行','衡水银行','曲靖市商业银行','深圳福田银座村镇银行','无锡农村商业银行','乌海银行','玉溪市商业银行',
            '浙江景宁银座村镇银行','浙江三门银座村镇银行'
        ]
    })
})(window, tmsky);